Semester 6/Spezielle Methoden der Programmierung/Blatt 02/StudentAdministration/app/controllers/course_controller.rb

INSERT INTO "courses" ("title", "description", "lecturer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "asd2"], ["description", "asd"], ["lecturer_id", 2], ["created_at", "2023-04-24 09:01:40.087174"], ["updated_at", "2023-04-24 09:01:40.087174"]]
---
  def create
    @course = Course.new course_params

    if @course.save