Semester 6/Spezielle Methoden der Programmierung/Blatt 02/StudentAdministration/app/controllers/lecturer_controller.rb

SELECT "lecturers".* FROM "lecturers"
---
  def index
    @course = Lecturer.all

INSERT INTO "lecturers" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Carsten"], ["last_name", "Gips"], ["created_at", "2023-04-24 08:04:11.095364"], ["updated_at", "2023-04-24 08:04:11.095364"]]
---
  def create
    @course = Lecturer.new lecturer_params

    if @course.save

SELECT "lecturers".* FROM "lecturers" WHERE "lecturers"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "lecturers" WHERE "lecturers"."id" = ?  [["id", 3]]
---
  def destroy
    @course = Lecturer.find(params[:id])
    @course.destroy