Semester 6/Spezielle Methoden der Programmierung/Blatt 02/StudentAdministration/app/controllers/students_controller.rb

INSERT INTO "students" ("matrikel", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["matrikel", "123"], ["first_name", "a"], ["last_name", "b"], ["created_at", "2023-04-23 20:20:41.724392"], ["updated_at", "2023-04-23 20:20:41.724392"]]
---
  def create
    @student = Student.new student_params

    if @student.save