Semester 6/Spezielle Methoden der Programmierung/Blatt 02/StudentAdministration/app/views/course/index.html.erb

SELECT "lecturers".* FROM "lecturers" WHERE "lecturers"."course_id" = ? LIMIT ?  [["course_id", 1], ["LIMIT", 1]]
---
    <td><%= course.description %></td>
    <td><%= Lecturer.find(course.lecturer_id).last_name %></td>