Semester 6/Spezielle Methoden der Programmierung/Blatt 02/StudentAdministration/app/views/course/new.html.erb

SELECT "lecturers".* FROM "lecturers"
---
    <%= form.label :lecturer %><br>
    <%= collection_select(:course, :lecturer_id, Lecturer.all, :id, :last_name) %>